; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	instrument7 - instrument
	satellite3 - satellite
	instrument8 - instrument
	instrument9 - instrument
	instrument10 - instrument
	satellite4 - satellite
	instrument11 - instrument
	satellite5 - satellite
	instrument12 - instrument
	instrument13 - instrument
	satellite6 - satellite
	instrument14 - instrument
	spectrograph1 - mode
	image2 - mode
	spectrograph0 - mode
	infrared3 - mode
	Star3 - direction
	GroundStation2 - direction
	Star4 - direction
	Star0 - direction
	Star1 - direction
	Star5 - direction
	Star6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(supports instrument0 spectrograph0)
	(supports instrument0 infrared3)
	(calibration_target instrument0 Star3)
	(supports instrument1 infrared3)
	(calibration_target instrument1 Star0)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 Star4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star4)
	(supports instrument3 spectrograph1)
	(calibration_target instrument3 Star3)
	(supports instrument4 infrared3)
	(supports instrument4 spectrograph1)
	(calibration_target instrument4 Star3)
	(supports instrument5 spectrograph1)
	(supports instrument5 infrared3)
	(calibration_target instrument5 Star3)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star5)
	(supports instrument6 image2)
	(calibration_target instrument6 Star1)
	(supports instrument7 image2)
	(supports instrument7 infrared3)
	(calibration_target instrument7 Star0)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star5)
	(supports instrument8 infrared3)
	(calibration_target instrument8 Star1)
	(supports instrument9 spectrograph1)
	(supports instrument9 infrared3)
	(supports instrument9 spectrograph0)
	(calibration_target instrument9 GroundStation2)
	(supports instrument10 spectrograph0)
	(supports instrument10 infrared3)
	(supports instrument10 spectrograph1)
	(calibration_target instrument10 Star1)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(on_board instrument10 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon8)
	(supports instrument11 image2)
	(calibration_target instrument11 Star4)
	(on_board instrument11 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star4)
	(supports instrument12 spectrograph1)
	(calibration_target instrument12 Star0)
	(supports instrument13 image2)
	(supports instrument13 infrared3)
	(supports instrument13 spectrograph1)
	(calibration_target instrument13 Star0)
	(on_board instrument12 satellite5)
	(on_board instrument13 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Star1)
	(supports instrument14 spectrograph0)
	(supports instrument14 spectrograph1)
	(supports instrument14 image2)
	(calibration_target instrument14 Star1)
	(on_board instrument14 satellite6)
	(power_avail satellite6)
	(pointing satellite6 Star0)
)
(:goal (and
	(pointing satellite1 Star4)
	(pointing satellite5 Star5)
	(have_image Star5 spectrograph0)
	(have_image Star6 spectrograph1)
	(have_image Star7 spectrograph1)
	(have_image Phenomenon8 spectrograph1)
	(have_image Phenomenon9 image2)
))

)

; plan
1. (turn_to satellite6 star1 star0)
   deleted: (pointing satellite6 star0)
   added: (pointing satellite6 star1)
   goals met: 0 of 7
2. (switch_on instrument14 satellite6)
   deleted: (power_avail satellite6)
   added: (power_on instrument14)
   goals met: 0 of 7
3. (calibrate satellite6 instrument14 star1)
   added: (calibrated instrument14)
   goals met: 0 of 7
4. (turn_to satellite6 phenomenon9 star1)
   deleted: (pointing satellite6 star1)
   added: (pointing satellite6 phenomenon9)
   goals met: 0 of 7
5. (take_image satellite6 phenomenon9 instrument14 image2)
   added: (have_image phenomenon9 image2)
   goals met: 1 of 7
6. (turn_to satellite6 phenomenon8 phenomenon9)
   deleted: (pointing satellite6 phenomenon9)
   added: (pointing satellite6 phenomenon8)
   goals met: 1 of 7
7. (turn_to satellite5 star5 star1)
   deleted: (pointing satellite5 star1)
   added: (pointing satellite5 star5)
   goals met: 2 of 7
8. (turn_to satellite1 star4 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 star4)
   goals met: 3 of 7
9. (take_image satellite6 phenomenon8 instrument14 spectrograph1)
   added: (have_image phenomenon8 spectrograph1)
   goals met: 4 of 7
10. (turn_to satellite6 star5 phenomenon8)
   deleted: (pointing satellite6 phenomenon8)
   added: (pointing satellite6 star5)
   goals met: 4 of 7
11. (take_image satellite6 star5 instrument14 spectrograph0)
   added: (have_image star5 spectrograph0)
   goals met: 5 of 7
12. (turn_to satellite6 star6 star5)
   deleted: (pointing satellite6 star5)
   added: (pointing satellite6 star6)
   goals met: 5 of 7
13. (take_image satellite6 star6 instrument14 spectrograph1)
   added: (have_image star6 spectrograph1)
   goals met: 6 of 7
14. (turn_to satellite6 star7 star6)
   deleted: (pointing satellite6 star6)
   added: (pointing satellite6 star7)
   goals met: 6 of 7
15. (take_image satellite6 star7 instrument14 spectrograph1)
   added: (have_image star7 spectrograph1)
   goals met: 7 of 7
